Repository: ahmedzayan7920/prayer_app
Catalog: lib/l10n/intl_*.arb
Languages: ar

# app_name
source: Prayer Times
ar: مواقيت الصلاة

source: Fajr
ar: الفجر

source: Duhr
ar: الظهر

source: Asr
ar: العصر

source: Maghreeb
ar: المغرب

source: Esha
ar: العشاء

source: English
ar: الانجليزية

source: Arabic
ar: العربية

# connectionTimeout
source: Connection timeout with ApiServer
ar: اتصال بالخادم فشل

# sendTimeout
source: Send timeout with ApiServer
ar: إرسال فشل

# receiveTimeout
source: Receive timeout with ApiServer
ar: تم استلام الرسالة فشل

# cancelError
source: Request to ApiServer was canceled
ar: تم إلغاء الطلب

# noInternet
source: No Internet Connection
ar: لا يوجد اتصال بالانترنت

# unexpectedError
source: Unexpected Error, Please try again
ar: خطأ غير متوقع

# notFound
source: Your request not found, Please try later
ar: لم يتم العثور على الطلب

# internalServerError
source: Internal Server error, Please try later
ar: خطأ في الخادم

source: Bad certificate
ar: الشهادة غير صالحة

# locationNotFound
source: Required platform-specific configuration is missing. Please ensure the proper permissions are defined in the AndroidManifest.xml or Info.plist.
ar: الإعدادات الخاصة بالنظام الأساسي مفقودة. يرجى التأكد من أن الأذونات الصحيحة محددة في ملف AndroidManifest.xml أو Info.plist.

# locationInProgress
source: Permission request is already in progress. Please wait for the current request to complete.
ar: طلب الإذن قيد التقدم بالفعل. يرجى الانتظار حتى يكتمل الطلب الحالي.

# locationTimeout
source: Location request timed out. Please try again or check your location settings.
ar: انتهت مهلة طلب الموقع. يرجى المحاولة مرة أخرى أو التحقق من إعدادات الموقع.

# locationServiceDisabled
source: Location services are disabled. Please enable location services in your device settings.
ar: خدمات الموقع معطلة. يرجى تمكين خدمات الموقع في إعدادات الجهاز.

# locationDenied
source: Location permission was denied. Please enable location permission in your device settings.
ar: تم رفض أذن الموقع. يرجى تمكين أذن الموقع في أعدادات الجهاز.

# locationPermanentlyDenied
source: Location permission was permanently denied. Please enable location permission in your device settings.
ar: إذن الموقع مرفوض بشكل دائم. يرجى تمكين أذن الموقع في أعدادات الجهاز.

source: Unable to determine location permission.
ar: غير قادر على تحديد أذن الموقع.

source: Retry
ar: أعد المحاولة
